[
  {
  "title": "Совершенный код. Руководство по разработке программного обеспечения",
  "slug": "sovcode",
  "price": "869 руб.",
  "excerpt": "Более 10 лет первое издание этой книги считалось одним из лучших практических руководств по программированию. Сейчас эта книга полностью обновлена...",
  "content": "Более 10 лет первое издание этой книги считалось одним из лучших практических руководств по программированию. Сейчас эта книга полностью обновлена с учетом современных тенденций и технологий и дополнена сотнями новых примеров, иллюстрирующих искусство и науку программирования. Опираясь на академические исследования, с одной стороны, и практический опыт коммерческих разработок ПО - с другой, автор синтезировал из самых эффективных методик и наиболее эффективных принципов ясное прагматичное руководство. Каков бы ни был ваш профессиональный уровень, с какими бы средствами разработками вы ни работали, какова бы ни была сложность вашего проекта, в этой книге вы найдете нужную информацию, она заставит вас размышлять и поможет создать совершенный код. Книга состоит из 35 глав, предметного указателя и библиографии.",
  "thumb": "img/codecomplete-sm.jpg",
  "img": "img/codecomplete.jpg",
  "chars":{
        "Ориг.название": "Code Complete: Second Edition",
        "Автор": "Ещё одна характеристика",
        "Формат издания": "170x240 мм (средний формат)",
        "Количество страниц": "896",
        "Год выпуска": "2017",
        "ISBN": "978-5-7502-0064-1",
        "Тираж": "2000",
        "Издательства": "Русская Редакция, Microsoft Press",
        "Редактор": "В. Вшивцев",
        "Переплет": "Твердый переплет",
        "Язык издания": "Русский",
        "Тип издания": "Отдельное издание",
        "Вес в упаковке, г": "1255"
      }
    },
    {
      "title": "Философия DevOps. Искусство управления IT",
      "slug": "devops",
      "price": "1162 руб.",
      "excerpt": "IT-принцип \"agile\" стал мантрой цифровой эпохи. С ростом проектов, переходом от монолитных приложений к системе микросервисов, увеличением...",
      "content": "IT-принцип \"agile\" стал мантрой цифровой эпохи. С ростом проектов, переходом от монолитных приложений к системе микросервисов, увеличением и накоплением продуктов возникают вопросы, которые требуют совершенно иного подхода. Теперь наибольший интерес вызывает находящаяся на стыке разработки и операционного управления методология DevOps. DevOps - это не просто набор техник, это философия. Разработчики, зацикленные на пользователях, должны уделять внимание поддержке и ее запросам. Сисадмины должны сообщать о проблемах продукта и вносить свой вклад в улучшение процесса работы. Но налаживание связей внутри компании - это лишь первый шаг. Чтобы продукт стал простым и удобным, придется вложить время и ресурсы в его доработку. Конфигурация через центральную службу, внедрение простым копированием, отсутствие внешних зависимостей, обдуманные метрики вместо мусора в логах - вот лишь часть задач, которые придется решать на этом пути.\n Книга \"Философия DevOps\" познакомит вас с техническими, культурными и управленческими аспектами devops-культуры и позволит организовать работу так, чтобы вы получали удовольствие от разработки, поддержки и использования программного обеспечения.",
      "thumb": "img/devops-sm.jpg",
      "img": "img/devops.jpg",
      "chars": {
        "Ориг.название": "Effective DevOps: Building a Culture of Collaboration, Affinity, and Tooling at Scale",
        "Авторы": "Дженнифер Дэвис, Кэтрин Дэниелс",
        "Формат издания": "170x240 мм (средний формат)",
        "Количество страниц": "416",
        "Год выпуска": "2017",
        "ISBN": "978-5-496-02555-3",
        "Тираж": "1000",
        "Издательство": "Питер",
        "Серия": "Бестселлеры O'Reilly",
        "Переплет": "Мягкая обложка",
        "Язык издания": "Русский",
        "Тип издания": "Отдельное издание",
        "Вес в упаковке, г": "530"
      }
    },
    {
      "title": "Git для профессионального программиста",
      "slug": "git",
      "price": "1149 руб.",
      "excerpt": "Эта книга представляет собой обновленное руководство по использованию Git в современных условиях. С тех пор как проект Git - распределенная...",
      "content": "Эта книга представляет собой обновленное руководство по использованию Git в современных условиях. С тех пор как проект Git - распределенная система управления версиями - был создан Линусом Торвальдсом, прошло много лет, и система Git превратилась в доминирующую систему контроля версий, как для коммерческих целей, так и для проектов с открытым исходным кодом. Эффективный и хорошо реализованный контроль версий необходим для любого успешного веб-проекта. Постепенно эту систему приняли на вооружение практически все сообщества разработчиков ПО с открытым исходным кодом. Появление огромного числа графических интерфейсов для всех платформ и поддержка IDE позволили внедрить Git в операционные системы семейства Windows. Второе издание книги было обновлено для Git-версии 2.0 и уделяет большое внимание GitHub.",
      "thumb": "img/git-sm.jpg",
      "img": "img/git.jpg",
      "chars": {
        "Авторы": "Скотт Чакон, Бен Штрауб",
        "Формат издания": "170x240 мм (средний формат)",
        "Количество страниц": "496",
        "Год выпуска": "2017",
        "ISBN": "978-5-496-01763-3",
        "Тираж": "500",
        "Издательство": "Питер",
        "Серия": "Библиотека программиста",
        "Переплет": "Мягкая обложка",
        "Язык издания": "Русский",
        "Тип издания": "Отдельное издание",
        "Вес в упаковке, г": "620"
      }
    },
    {
      "title": "PHP. Объекты, шаблоны и методики программирования",
      "slug": "php",
      "price": "1359 руб.",
      "excerpt": "Четвертое издание книги было пересмотрено и дополнено новым материалом. Книга начинается с обзора объектно-ориентированных возможностей php...",
      "content": "Четвертое издание книги было пересмотрено и дополнено новым материалом. Книга начинается с обзора объектно-ориентированных возможностей PHP, в который включены важные темы, такие как определение классов, наследование, инкапсуляция, рефлексия и многое другое. Этот материал закладывает основы объектно-ориентированного проектирования и программирования на PHP. Вы изучите также некоторые основополагающие принципы проектирования. В этом издании книги также описаны возможности, появившиеся в PHP версии 5.4, такие как трейты, дополнительные расширения на основе рефлексии, уточнения типов параметров методов, улучшенная обработка исключений и много других мелких расширений языка. Следующая часть книги посвящена шаблонам проектирования, которые органически дополняют тему ООП и являются описанием элегантных решений распространенных проблем, возникающих при проектировании программного обеспечения. В ней описываются концепции шаблонов проектирования и показаны способы реализации нескольких важных шаблонов в приложениях на PHP. В этой же части приведен материал, посвященный шаблонам корпоративных приложений и баз данных.<br/> В последней части книги описывается несколько важных утилит и методик, помогающих осуществить успешный проект на основе разрозненных кусков кода. В этой части книги описано, как управлять работой нескольких программистов с помощью Git, как выполнить построение и развертывание проекта с помощью Phing и PEAR.<br/>Вы также изучите стратегии автоматического тестирования и построения проектов. Кроме обсуждения передовых средств построения и тестирования проектов, а также серверов непрерывной интеграции, в последней части книги описаны лучшие методики организации работы на основе системы контроля версий Git. Тем самым была отражена общая тенденция перехода на новую платформу, которая наметилась в среде разработчиков с момента выхода третьего издания книги.",
      "thumb": "img/php-sm.jpg",
      "img": "img/php.jpg",
      "chars": {
        "Ориг.название": "PHP Objects, Patterns, and Practice",
        "Автор": "Мэт Зандстра",
        "Формат издания": "170x240 мм (средний формат)",
        "Количество страниц": "576",
        "Год выпуска": "2016",
        "ISBN": "978-5-8459-1922-9",
        "Тираж": "1000",
        "Издательство": "Вильямс",
        "Переводчик": "С. Тригуб",
        "Переплет": "Твердый переплет",
        "Язык издания": "Русский",
        "Тип издания": "Отдельное издание",
        "Вес в упаковке": "г: 875"
      }
    },
    {
      "title": "Чистый код: создание, анализ и рефакторинг. Библиотека программиста",
      "slug": "clearcode",
      "price": "494 руб.",
      "excerpt": "Даже плохой программный код может работать. Однако если код не является \"чистым\", это всегда будет мешать развитию проекта и компании-разработчика...",
      "content": "Даже плохой программный код может работать. Однако если код не является \"чистым\", это всегда будет мешать развитию проекта и компании-разработчика, отнимая значительные ресурсы на его поддержку и \"укрощение\". Эта книга посвящена хорошему программированию. Она полна реальных примеров кода. Мы будем рассматривать код с различных направлений: сверху вниз, снизу вверх и даже изнутри. Прочитав книгу, вы узнаете много нового о коде. Более того, вы научитесь отличать хороший код от плохого. Вы узнаете, как писать хороший код и как преобразовать плохой код в хороший. Книга состоит из трех частей. В первой части излагаются принципы, паттерны и приемы написания чистого кода; приводится большой объем примеров кода. Вторая часть состоит из практических сценариев нарастающей сложности. Каждый сценарий представляет собой упражнение по чистке кода или преобразованию проблемного кода в код с меньшим количеством проблем. Третья часть книги - концентрированное выражение ее сути. Она состоит из одной главы с перечнем эвристических правил и \"запахов кода\", собранных во время анализа. Эта часть представляет собой базу знаний, описывающую наш путь мышления в процессе чтения, написания и чистки кода.",
      "thumb": "img/clearcode-sm.jpg",
      "img": "img/clearcode.jpg",
      "chars": {
        "Автор": "Роберт К. Мартин",
        "Формат издания": "170x240 мм (средний формат)",
        "Количество страниц": "464",
        "Год выпуска": "2016",
        "ISBN": "978-5-496-00487-9, 978-0332350884",
        "Тираж": "1000",
        "Издательство": "Питер",
        "Серия": "Библиотека программиста",
        "Переводчик": "Е. Матвеев",
        "Переплет": "Мягкая обложка",
        "Язык издания": "Русский",
        "Тип издания": "Отдельное издание",
        "Вес в упаковке, г": "606"
      }
    }
]